# SQL Practice Problems using sqlite + Pandas + Jupyter notebooks and Northwinds Database

###### DB: https://docs.microsoft.com/en-us/dotnet/framework/data/adonet/sql/linq/downloading-sample-databases

In [4]:
import sqlite3

# Create a SQL connection to our SQLite database
con = sqlite3.connect("Northwind_large.sqlite")

In [7]:
# check available tables 

cur = con.cursor()
cur.execute("SELECT name FROM sqlite_master WHERE type='table' ORDER BY name;")
available_table=(cur.fetchall())
available_table

[('Category',),
 ('Customer',),
 ('CustomerCustomerDemo',),
 ('CustomerDemographic',),
 ('Employee',),
 ('EmployeeTerritory',),
 ('Order',),
 ('OrderDetail',),
 ('Product',),
 ('Region',),
 ('Shipper',),
 ('Supplier',),
 ('Territory',)]

In [8]:
#excercise 2 : Get Category Name, Description from Category

cur.execute('SELECT CategoryName, Description FROM Category;')
cur.fetchall()

[('Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 ('Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 ('Confections', 'Desserts, candies, and sweet breads'),
 ('Dairy Products', 'Cheeses'),
 ('Grains/Cereals', 'Breads, crackers, pasta, and cereal'),
 ('Meat/Poultry', 'Prepared meats'),
 ('Produce', 'Dried fruit and bean curd'),
 ('Seafood', 'Seaweed and fish')]

In [9]:
#excercise 3 : USA Sales representatives

import pandas as pd
Q = 'SELECT FirstName, LastName, HireDate from Employee where title = "Sales Representative" and country = "USA";'
pd.read_sql( Q , con)

  FirstName   LastName    HireDate
0     Nancy    Davolio  2024-05-01
1     Janet  Leverling  2024-04-01
2  Margaret    Peacock  2025-05-03

In [12]:
#excercise 4 Orders and id for employeeID = 5
Q = 'SELECT ID, OrderDate, EmployeeID from "Order" where EmployeeID = 5;'
pd.read_sql( Q , con)

         Id            OrderDate  EmployeeId
0     10248           2012-07-04           5
1     10254           2012-07-11           5
2     10269           2012-07-31           5
3     10297           2012-09-04           5
4     10320           2012-10-03           5
...     ...                  ...         ...
1854  27047  2015-02-12 23:01:30           5
1855  27048  2015-08-15 13:14:24           5
1856  27053  2015-03-11 05:01:22           5
1857  27061  2013-06-29 21:05:55           5
1858  27063  2014-10-15 09:51:09           5

[1859 rows x 3 columns]

In [16]:
# Excercise 6: Suppliers whose ContactTitle is not Marketing Manager

Q = 'SELECT Id,ContactTitle,ContactName   from Supplier where ContactTitle not in ("Marketing Manager");'
pd.read_sql( Q , con)

    Id                  ContactTitle                 ContactName
0    1            Purchasing Manager            Charlotte Cooper
1    2           Order Administrator               Shelley Burke
2    3          Sales Representative               Regina Murphy
3    5          Export Administrator  Antonio del Valle Saavedra
4    6      Marketing Representative                 Mayumi Ohno
5    8          Sales Representative                Peter Wilson
6    9                   Sales Agent               Lars Peterson
7   11                 Sales Manager               Petra Winkler
8   12  International Marketing Mgr.                 Martin Bein
9   13   Coordinator Foreign Markets               Sven Petersen
10  14          Sales Representative                  Elio Rossi
11  16         Regional Account Rep.               Cheryl Saylor
12  17          Sales Representative               Michael Björn
13  18                 Sales Manager              Guylène Nodier
14  19       Wholesale Account Agent               Robb Merchant
15  20                         Owner                Chandra Leka
16  21                 Sales Manager              Niels Petersen
17  22            Accounting Manager                 Dirk Luchte
18  23               Product Manager              Anne Heikkonen
19  24          Sales Representative             Wendy Mackenzie
20  26           Order Administrator            Giovanni Giudici
21  27                 Sales Manager              Marie Delamare
22  28          Sales Representative                  Eliane Noz
23  29            Accounting Manager              Chantal Goulet

In [17]:
Q = 'SELECT Id,ContactTitle,ContactName   from Supplier where ContactTitle <> "Marketing Manager";'
pd.read_sql( Q , con)

    Id                  ContactTitle                 ContactName
0    1            Purchasing Manager            Charlotte Cooper
1    2           Order Administrator               Shelley Burke
2    3          Sales Representative               Regina Murphy
3    5          Export Administrator  Antonio del Valle Saavedra
4    6      Marketing Representative                 Mayumi Ohno
5    8          Sales Representative                Peter Wilson
6    9                   Sales Agent               Lars Peterson
7   11                 Sales Manager               Petra Winkler
8   12  International Marketing Mgr.                 Martin Bein
9   13   Coordinator Foreign Markets               Sven Petersen
10  14          Sales Representative                  Elio Rossi
11  16         Regional Account Rep.               Cheryl Saylor
12  17          Sales Representative               Michael Björn
13  18                 Sales Manager              Guylène Nodier
14  19       Wholesale Account Agent               Robb Merchant
15  20                         Owner                Chandra Leka
16  21                 Sales Manager              Niels Petersen
17  22            Accounting Manager                 Dirk Luchte
18  23               Product Manager              Anne Heikkonen
19  24          Sales Representative             Wendy Mackenzie
20  26           Order Administrator            Giovanni Giudici
21  27                 Sales Manager              Marie Delamare
22  28          Sales Representative                  Eliane Noz
23  29            Accounting Manager              Chantal Goulet

In [20]:
# Excercise 7: Product name contains the string queso

Q = 'SELECT Id, ProductName from Product where ProductName like "%queso%";'
pd.read_sql( Q , con)

   Id                ProductName
0  11             Queso Cabrales
1  12  Queso Manchego La Pastora

In [25]:
# Excercise 8: Shipping Country is either France or Belgium


Q = 'SELECT Id, CustomerId,ShipCountry  from "Order" where ShipCountry in ("France", "Belgium");'
pd.read_sql( Q , con)

         Id CustomerId ShipCountry
0     10248      VINET      France
1     10251      VICTE      France
2     10252      SUPRD     Belgium
3     10265      BLONP      France
4     10274      VINET      France
...     ...        ...         ...
2182  27024      OTTIK      France
2183  27034      LEHMS      France
2184  27035      RANCH      France
2185  27038      NORTS     Belgium
2186  27062      FRANK      France

[2187 rows x 3 columns]

In [27]:
# Excercise 10: Employees ordered by BirthDate

Q = 'SELECT FirstName,LastName, Title, BirthDate from Employee order by BirthDate;'
pd.read_sql( Q , con)

  FirstName   LastName                     Title   BirthDate
0  Margaret    Peacock      Sales Representative  1969-09-19
1     Nancy    Davolio      Sales Representative  1980-12-08
2    Andrew     Fuller     Vice President, Sales  1984-02-19
3    Steven   Buchanan             Sales Manager  1987-03-04
4     Laura   Callahan  Inside Sales Coordinator  1990-01-09
5    Robert       King      Sales Representative  1992-05-29
6   Michael     Suyama      Sales Representative  1995-07-02
7     Janet  Leverling      Sales Representative  1995-08-30
8      Anne  Dodsworth      Sales Representative  1998-01-27